{
  "name": "Lacking personality",
  "cleanName": "lackingpersonality",
  "author": "Michel Moreau",
  "date": "2019-05-14T00:00:00-04:00",
  "post": "<p>Lacking personality can mean a lot of things.</p>\n\n<p>\n  However, in my humble opinion, a common usage of the term lack of personality\n  that hinders one&rsquo;s own well-being over the long term relates to\n  personality repression.\n</p>\n\n<p>\n  Personality repression means excessively complying and living one&rsquo;s life\n  through the influence of other people&rsquo;s desires/opinions, ignoring\n  one&rsquo;s own. Not having a sense of self-expression and self-directedness\n  for one&rsquo;s own life, always referring to what other people are doing to\n  figure out what to do next for oneself.\n</p>\n\n<p>\n  As a real-life example of that, you can imagine someone who radically changes\n  her day-to-day behaviors every time she changes her life partner, whether it\n  be a boyfriend, girlfriend, etc.\n</p>\n\n<p>Other real-life potential cues of personality repression:</p>\n<ul>\n  <li>\n    A ridiculously high frequency of &ldquo;me too&rdquo; or similar statements\n    in someone&rsquo;s conversation stance with another person.\n  </li>\n  <li>\n    Drastic personality modification depending on the group a person spends time\n    with. It can be in the way someone dresses, talks, thinks, eats, exercises,\n    or any other manifestation of personality.\n  </li>\n  <li>\n    A recurrent feeling of unease after saying yes to someone, when you really\n    wanted to say no (or vice versa).\n  </li>\n</ul>\n<p>\n  Jeffrey Young talks about this concept in his book Reinventing Your Life, in\n  which he discusses different lifetraps people can fall into that are usually\n  developed through emotionally-charged past life experiences. The one that\n  relates to personality repression in his book is called the subjugation\n  lifetrap, as in subjugating to other people&rsquo;s needs and wants.\n</p>\n<p>\n  I highly recommend his book if the concept of personality repression resonated\n  with you, even if to a mild extent.\n</p>\n\n<p>Take good care.</p>\n",
  "img": "/static/postimages/lackingpersonality.jpg",
  "svg": "/static/postimages/lackingpersonality.svg"
}
