{
  "name": "The Career You Should Pursue",
  "cleanName": "whatkindofcareershouldyoupursue",
  "author": "Michel Moreau",
  "date": "2019-04-25T00:00:00-04:00",
  "post": "<p>\n  If you google this question online, you will find this question has been\n  answered multiple times.\n</p>\n\n<p>\n  I would bet many people provide specific answers based on personality, skills,\n  temperament. And this is fine &ndash; being conscious of your human nature is\n  a good thing, and hopefully it will guide you toward a career you will enjoy.\n</p>\n\n<p>\n  However, nobody will nor can choose for you in the end. Here is a an approach\n  that will lead you to <span style=\"font-style: italic;\">choosing</span> a\n  career that adds meaning to your life:\n</p>\n\n<ul>\n  <li>\n    Learn broadly and constantly on many topics. Psychology, philosophy,\n    politics, engineering, mathematics, physics, arts, history, etc. It will\n    help you form a broad view of the world you live in.\n  </li>\n  <li>\n    Find the problems that are important to you and the people around you. As\n    your view of the world expands, do not hesitate to change course along the\n    way.\n  </li>\n  <li>\n    Determine the skills needed to fix the problems you want to solve and\n    acquire them. Persevere.\n  </li>\n  <li>\n    Connect with people interested in solving the same problems you want to\n    solve.\n  </li>\n  <li>\n    With courage, patience, and self-directedness, be willing to try and fix the\n    identified problems. Again, try to surround yourself with critical but\n    empowering influences wanting you to succeed.\n  </li>\n</ul>\n<p>\n  Self-directedness toward fixing the problems that matter to you, with the\n  right people besides you, is your only path to having a meaningful career.\n</p>\n<p>\n  Don't waste too much time listening to other people's opinions. In the matter\n  of career choices, do your own thinking and experiencing.\n</p>\n",
  "img": "/static/postimages/whatkindofcareershouldyoupursue.jpg",
  "svg": "/static/postimages/whatkindofcareershouldyoupursue.svg"
}
