[
    {
        "name": "A natural love for thinking",
        "cleanName": "anaturalloveforthinking",
        "author": "Michel Moreau",
        "date": "2019-05-14T00:00:00-04:00",
        "post": "<p>The thinking&#8230;</p>\n\n<p>About anything that matters to me&#8230;</p>\n\n<p>Continues as long as it needs to&#8230;</p>\n\n<p>Until I have all the answers that I need&#8230;</p>\n\n<p>And I like it.</p>\n",
        "img": "/static/postimages/anaturalloveforthinking.jpg",
        "svg": "/static/postimages/anaturalloveforthinking.svg"
    },
    {
        "name": "What makes a person good",
        "cleanName": "whatmakesapersongood",
        "author": "Michel Moreau",
        "date": "2019-05-14T00:00:00-04:00",
        "post": "<p>A subjective opinion, no matter its content and rational.</p>\n<p>A good person is what you choose it to be.</p>\n",
        "img": "/static/postimages/whatmakesapersongood.jpg",
        "svg": "/static/postimages/whatmakesapersongood.svg"
    },
    {
        "name": "A story about grit",
        "cleanName": "astoryaboutgrit",
        "author": "Michel Moreau",
        "date": "2019-05-14T00:00:00-04:00",
        "post": "<p>\n  One of the greatest thing in life is the feeling of succeeding at something\n  after having struggled miserably for a significant period of time.\n</p>\n<p>I have a close friend, Leo.</p>\n<p>\n  Leo chose to quit his 6 figure engineering job to start a company around the\n  age of 24. He went on to live 5 years with friends but didn&rsquo;t really\n  have a bedroom (for Canadian standards) - it was more like a closet with a\n  single bed in it. He convinced our friends to rent the closet for 200$/month.\n  His roommates were not entrepreneurs and were smarts in their own ways. They\n  were all progressing rapidly in their careers, while Leo was struggling to\n  find product-market fit with his idea for years.\n</p>\n<p>\n  However, Leo was regularly stating he was making progress over these years,\n  yet most people of his surroundings started questioning his plans right after\n  year 1. People tried to convince him to get back to an engineering job many\n  times, tried to talk him into the fact he was becoming a bit crazy, were\n  laughing at him and thinking he was a joke, etc. Leo chose to keep at it\n  regardless.\n</p>\n<p>\n  Leo took a part-time job around year 3 to be able to continue on his\n  entrepreneurial journey. Finally, he started earning money from his business\n  during year four and signed a huge deal during year five which instantly made\n  him the biggest earner of anyone in his group of friends. Even more beautiful,\n  a lot of our friends, including myself, were starting to use his service!\n</p>\n<p>Leo was not a joke anymore.</p>\n<p>\n  For anything that&rsquo;s hard, you never **really** know when you&rsquo;re\n  gonna get there. Trust yourself and the process.\n</p>\n<img\n  class=\"responsive-img\"\n  src=\"/static/success.jpg\"\n  alt=\"Graphical representation of success\"\n/>\n",
        "img": "/static/postimages/astoryaboutgrit.jpg",
        "svg": "/static/postimages/astoryaboutgrit.svg"
    }
]