[
    {
        "name": "A natural love for thinking",
        "cleanName": "anaturalloveforthinking",
        "author": "Michel Moreau",
        "date": "2019-05-14T00:00:00-04:00",
        "post": "<p>The thinking&#8230;</p>\n\n<p>About anything that matters to me&#8230;</p>\n\n<p>Continues as long as it needs to&#8230;</p>\n\n<p>Until I have all the answers that I need&#8230;</p>\n\n<p>And I like it.</p>",
        "img": "/static/postimages/anaturalloveforthinking.jpg",
        "svg": "/static/postimages/anaturalloveforthinking.svg"
    },
    {
        "name": "What makes a person good",
        "cleanName": "whatmakesapersongood",
        "author": "Michel Moreau",
        "date": "2019-05-14T00:00:00-04:00",
        "post": "<p>A subjective opinion, no matter its content and rational.</p>\n<p>A good person is what you choose it to be.</p>",
        "img": "/static/postimages/whatmakesapersongood.jpg",
        "svg": "/static/postimages/whatmakesapersongood.svg"
    },
    {
        "name": "A story about grit",
        "cleanName": "astoryaboutgrit",
        "author": "Michel Moreau",
        "date": "2019-05-14T00:00:00-04:00",
        "post": "<p>One of the greatest thing in life is the feeling of succeeding at something after having struggled miserably for a significant period of time.</p>\n<hr class=\"hr-post\">\n<p>I have a close friend, Leo.</p>\n\n<p>Leo chose to quit his 6 figure engineering job to start a company around the age of 24. He went on to live 5 years with friends but didn&rsquo;t really have a bedroom (for Canadian standards) - it was more like a closet with a single bed in it. He convinced our friends to rent the closet for 200$/month. His roommates were not entrepreneurs and were smarts in their own ways. They were all progressing rapidly in their careers, while Leo was struggling to find product-market fit with his idea for years.</p>\n\n<p>However, Leo was regularly stating he was making progress over these years, yet most people of his surroundings started questioning his plans right after year 1. People tried to convince him to get back to an engineering job many times, tried to talk him into the fact he was becoming a bit crazy, were laughing at him. were thinking he was a joke, etc. Leo chose to keep at it regardless.</p>\n\n<p>Leo took a part-time job around year 3 to be able to continue on his entrepreneurial journey. Finally, he started earning money from his business during year four and signed a huge deal during year five which instantly made him the biggest earner of anyone in his group of friends. Even more beautiful, a lot of our friends, including myself, were starting to use his service!</p>\n\n<p>Leo was not a joke anymore.</p>\n<hr class=\"hr-post\">\n<p>I remember our long stare moment the day he told me he had signed the huge deal. We starred at each other for like 10 seconds, then:</p>\n\n<p>- Me: &ldquo;Good job my friend&rdquo; [with a smile demonstrating I was super impressed and proud of him]</p>\n\n<p>- Leo: [moment of silence, watery eyes, lump in the throat]</p>\n\n<p>- Leo: &ldquo;Thank you&rdquo;</p>\n\n<p>- Leo and Me: [genuine hug]</p>\n<hr class=\"hr-post\">\n<p>The image below has been circulating on the web for a while now, but I believe this is the best representation as to why success tastes so good.</p>\n\n<p>For anything that&rsquo;s hard, you never **really** know when you&rsquo;re gonna get there. Trust yourself and the process.</p>\n<img\n  class=\"responsive-img\"\n  src=\"/static/success.jpg\"\n  alt=\"Graphical representation of success\"\n/>",
        "img": "/static/postimages/astoryaboutgrit.jpg",
        "svg": "/static/postimages/astoryaboutgrit.svg"
    }
]