{
    "readingStatus": "Read",
    "cleanName": "neurolinguisticprogramming",
    "originalQuery": "neuro-linguistic programming johnny bell",
    "kind": "books#volume",
    "id": "moTXrQEACAAJ",
    "etag": "9fD7uLI/1V4",
    "selfLink": "https://www.googleapis.com/books/v1/volumes/moTXrQEACAAJ",
    "volumeInfo": {
        "title": "Neuro-Linguistic Programming",
        "subtitle": "An Essential Guide to Nlp: A Personalized Guide to Reach Self-Fulfillment",
        "authors": [
            "Jonny Bell"
        ],
        "publisher": "CreateSpace",
        "publishedDate": "2014-07-11",
        "description": "Neuro-Linguistic Programming (NLP): A Personalized Guide to Reach Self-FulfillmentHave you ever wondered: How can I finally feel free of past restraints? How can I forgive myself for my mistakes? How can I beat back against depression? How can I maintain true motivation to fuel my life? Keep reading.Neuro-Linguistic Programming: A Practical Guide to Reach Self-Fulfillment:Alerts you to the forefront of mental guidance with the surge of Neuro-Linguistic Programming. Its scientific analyses create a broad internal excitement to continue to live and to find the life you've always wanted; it helps you understand that you can have the life of your dreams and fight back against all your interior demons. It understands the human race and your interior struggle, and it works to make things easier, every day. Neuro-Linguistic Programming provides you the strength to work from inside your mind in order to strengthen your beliefs, your attitudes, and your behaviors. It allows you to root yourself firmly in your passions. However, making these interior changes isn't beneficial unless you understand how to change your life for the better. Grab the reigns of your life, and allow this book to keep your grip. Neuro-Linguistic Programming analyzes all factors of human relationships: relationships with yourself and with your loved ones, and takes both a physical and an emotional stance on your life. It lends you equal harmony while offering brilliant tips to keep yourself centered, to keep yourself whole. Topics covered: Neuro-Linguistic Programming: An Introductory Overview Activating and Improving Sensory Acuity Analyzing Submodalities for Change Understanding Representational Systems Reading Rapport Achieving Anchoring Strategies and NLP Churning through Language Patterns The Art of Reframing NLP Model of Therapy: A Summation Altering One's Personal History and Forming Resurgence into the Future All these advanced psychology techniques are broken down into proven practical step-by-step approach to allow anyone start implementing the steps. Begin recreating your life for the better by taking action.",
        "industryIdentifiers": [
            {
                "type": "ISBN_10",
                "identifier": "1503157091"
            },
            {
                "type": "ISBN_13",
                "identifier": "9781503157095"
            }
        ],
        "readingModes": {
            "text": false,
            "image": false
        },
        "pageCount": 64,
        "printType": "BOOK",
        "maturityRating": "NOT_MATURE",
        "allowAnonLogging": false,
        "contentVersion": "preview-1.0.0",
        "imageLinks": {
            "smallThumbnail": "http://books.google.com/books/content?id=moTXrQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "thumbnail": "http://books.google.com/books/content?id=moTXrQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
        },
        "language": "en",
        "previewLink": "http://books.google.ca/books?id=moTXrQEACAAJ&dq=neuro-linguistic+programming+johnny+bell&hl=&as_pt=BOOKS&cd=1&source=gbs_api",
        "infoLink": "http://books.google.ca/books?id=moTXrQEACAAJ&dq=neuro-linguistic+programming+johnny+bell&hl=&as_pt=BOOKS&source=gbs_api",
        "canonicalVolumeLink": "https://books.google.com/books/about/Neuro_Linguistic_Programming.html?hl=&id=moTXrQEACAAJ"
    },
    "saleInfo": {
        "country": "CA",
        "saleability": "NOT_FOR_SALE",
        "isEbook": false
    },
    "accessInfo": {
        "country": "CA",
        "viewability": "NO_PAGES",
        "embeddable": false,
        "publicDomain": false,
        "textToSpeechPermission": "ALLOWED",
        "epub": {
            "isAvailable": false
        },
        "pdf": {
            "isAvailable": false
        },
        "webReaderLink": "http://play.google.com/books/reader?id=moTXrQEACAAJ&hl=&as_pt=BOOKS&printsec=frontcover&source=gbs_api",
        "accessViewStatus": "NONE",
        "quoteSharingAllowed": false
    },
    "searchInfo": {
        "textSnippet": "However, making these interior changes isn&#39;t beneficial unless you understand how to change your life for the better. Grab the reigns of your life, and allow this book to keep your grip."
    }
}